# GetScheduleHeightsOnSheet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewSchedule..::..GetScheduleHeightsOnSheet Method
ViewSchedule Class See Also
---
Gets the heights of schedule title, column header and each schedule body row.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public ScheduleHeightsOnSheet GetScheduleHeightsOnSheet()
```

Visual Basic
---
```text
Public Function GetScheduleHeightsOnSheet As ScheduleHeightsOnSheet
```

Visual C++
---
```text
public:
ScheduleHeightsOnSheet^ GetScheduleHeightsOnSheet()
```

# ### Return Value
The ScheduleHeightsOnSheet which contains heights information of a schedule on sheet.
# Remarks
The height is Revit's internal units value.
# See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace